/* ЗАДАЧА - 1
 * Создать переменую, записать в нее число, вывести значение этой переменной в консоль
 * */

/* ЗАДАНИЕ 2
 * Создать переменную при помощи ключевого слова const, записать в нее число.
 * Попробовать переприсвоить этой переменной новое число.
 * */

/* ЗАДАНИЕ 3
 * Записать в переменную '123', вывести в консоль typeof этой переменной.
 * Преобразовать эту переменную в численный тип при помощи унарный плюс +
 * После этого повторно вывести в консоль typeof этой переменной.
 * */

// let num = 'qw';
// console.log(typeof num);
// console.log(typeof +num);



/* ЗАДАНИЕ 4
 * Вывести на экран уведомление с текстом "Hello! This is alert" при помощи модального окна alert
 * */

// alert('Hello! This is alert');
/* ЗАДАНИЕ 5
 * Вывести на экран модальное окно prompt с сообщением "Enter the number".
 * Результат выполнения модального окна записать в переменную, значение которой вывести в консоль.
 * */

// let question = prompt('Enter the number');
// console.log(question); 

/* ЗАДАНИЕ 6
 * При помощи модального окна prompt получить от пользователя два числа.
 * Вывести в консоль сумму, разницу, произведение, результат деления и остаток от деления их друг на друга.
 * */

/* ЗАДАНИЕ 7
 * Спросить у пользователя какого он года рождения, и посчитать сколько ему лет*/

